// Напишите программу,
// которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
using System;

int i;

Console.WriteLine("Куб числа");

for (i = 1; i < 6; i++)
{
    Console.WriteLine(i*i*i);
}
    